wosayttn/M55M1BSP/_CUnit/spi/spi_cunit.c
    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_SPI_READ_RX()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPIModule->CLKDIV = 4;
    /* Master mode, SPI mode 0. */
    SPIModule->CTL = 0x00000005;
    /* Write 3 data to TX FIFO */
    SPIModule->TX = 1;
    SPIModule->TX = 2;
    SPIModule->TX = 3;

    /* Wait data transfer */
    while ((SPIModule->STATUS & SPI_STATUS_BUSY_Msk) != 0)
    {
        __NOP();
    }

    CU_ASSERT(SPI_GET_RX_FIFO_COUNT(SPIModule) == 3);
    SPI_READ_RX(SPIModule);
    CU_ASSERT(SPI_GET_RX_FIFO_COUNT(SPIModule) == 2);
    SPI_READ_RX(SPIModule);
    CU_ASSERT(SPI_GET_RX_FIFO_COUNT(SPIModule) == 1);
    SPI_READ_RX(SPIModule);
    CU_ASSERT(SPI_GET_RX_FIFO_COUNT(SPIModule) == 0);

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_SPI_WRITE_TX()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPIModule->CLKDIV = 0xFF;
    /* Slave mode, SPI mode 0. */
    SPIModule->CTL = 0x00040005;
    CU_ASSERT((SPIModule->STATUS & SPI_STATUS_TXCNT_Msk) == 0);
    SPI_WRITE_TX(SPIModule, 1);
    CU_ASSERT((SPIModule->STATUS & SPI_STATUS_TXCNT_Msk) == (0x1 << SPI_STATUS_TXCNT_Pos));
    SPI_WRITE_TX(SPIModule, 2);
    CU_ASSERT((SPIModule->STATUS & SPI_STATUS_TXCNT_Msk) == (0x2 << SPI_STATUS_TXCNT_Pos));

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_SPI_SET_SS_HIGH()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPI_SET_SS_HIGH(SPIModule);
    CU_ASSERT(SPIModule->SSCTL == 5);

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_SPI_SET_SS_LOW()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPI_SET_SS_LOW(SPIModule);
    CU_ASSERT(SPIModule->SSCTL == 1);

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_SPI_ENABLE_DISABLE_BYTE_REORDER()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPI_ENABLE_BYTE_REORDER(SPIModule);
    CU_ASSERT_TRUE(SPIModule->CTL & SPI_CTL_REORDER_Msk);
    SPI_DISABLE_BYTE_REORDER(SPIModule);
    CU_ASSERT_FALSE(SPIModule->CTL & SPI_CTL_REORDER_Msk);

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_SPI_SET_SUSPEND_CYCLE()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPI_SET_SUSPEND_CYCLE(SPIModule, 0);
    CU_ASSERT((SPIModule->CTL & SPI_CTL_SUSPITV_Msk) == 0);
    SPI_SET_SUSPEND_CYCLE(SPIModule, 8);
    CU_ASSERT((SPIModule->CTL & SPI_CTL_SUSPITV_Msk) == (0x8 << SPI_CTL_SUSPITV_Pos));
    SPI_SET_SUSPEND_CYCLE(SPIModule, 15);
    CU_ASSERT((SPIModule->CTL & SPI_CTL_SUSPITV_Msk) == (0xF << SPI_CTL_SUSPITV_Pos));

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_SPI_SET_LSB_MSB_FIRST()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPI_SET_LSB_FIRST(SPIModule);
    CU_ASSERT_TRUE(SPIModule->CTL & SPI_CTL_LSB_Msk);
    SPI_SET_MSB_FIRST(SPIModule);
    CU_ASSERT_FALSE(SPIModule->CTL & SPI_CTL_LSB_Msk);

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_SPI_SET_DATA_WIDTH()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPI_SET_DATA_WIDTH(SPIModule, 32);
    CU_ASSERT((SPIModule->CTL & 0x00001F00) == 0);
    SPI_SET_DATA_WIDTH(SPIModule, 8);
    CU_ASSERT((SPIModule->CTL & SPI_CTL_DWIDTH_Msk) == (0x8 << SPI_CTL_DWIDTH_Pos));
    SPI_SET_DATA_WIDTH(SPIModule, 16);
    CU_ASSERT((SPIModule->CTL & SPI_CTL_DWIDTH_Msk) == (0x10 << SPI_CTL_DWIDTH_Pos));

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_SPI_IS_BUSY()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPIModule->CLKDIV = 0xFF;
    SPIModule->CTL |= 1;
    SPIModule->TX = 1;
    CU_ASSERT_TRUE(SPI_IS_BUSY(SPIModule));

    /* Wait data transfer */
    while ((SPIModule->STATUS & SPI_STATUS_UNITIF_Msk) == 0)
    {
        __NOP();
    }

    CLK_SysTickDelay(5);

    CU_ASSERT_FALSE(SPI_IS_BUSY(SPIModule));

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_SPI_ENABLE_DISABLE()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    CU_ASSERT_FALSE(SPIModule->CTL & SPI_CTL_SPIEN_Msk);
    SPI_ENABLE(SPIModule);
    CU_ASSERT_TRUE(SPIModule->CTL & SPI_CTL_SPIEN_Msk);
    SPI_DISABLE(SPIModule);
    CU_ASSERT_FALSE(SPIModule->CTL & SPI_CTL_SPIEN_Msk);

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
}

void API_SPI_Open()
{
    uint32_t u32ReturnValue;
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    u32ReturnValue = SPI_Open(SPIModule, SPI_MASTER, SPI_MODE_0, 8, 1000000);
    //printf("1 SPIModule->CTL =  %x\r\n", SPIModule->CTL);
    //printf("1 u32ReturnValue =  %d\r\n", u32ReturnValue);
    CU_ASSERT(SPIModule->CTL == 0x00000835);
    CU_ASSERT(SPIModule->CLKDIV == 0x0000002F);
    CU_ASSERT(SPIModule->SSCTL == 0);
    CU_ASSERT(u32ReturnValue == 1000000);

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());

    u32ReturnValue = SPI_Open(SPIModule, SPI_SLAVE, SPI_MODE_1, 16, 2000000);
    //printf("2 SPIModule->CTL =  %x\r\n", SPIModule->CTL);
    //printf("2 u32ReturnValue =  %d\r\n", u32ReturnValue);
    CU_ASSERT(SPIModule->CTL == 0x00041037);
    CU_ASSERT(SPIModule->CLKDIV == 0x00000000);
    CU_ASSERT(SPIModule->SSCTL == 0x0);
    CU_ASSERT(u32ReturnValue == 100000000);

    /* Reset SPI1 */
    ResetSPI(GetSPIModuleIdx());

    u32ReturnValue = SPI_Open(SPIModule, SPI_MASTER, SPI_MODE_2, 24, 5000000);
    //printf("3 SPIModule->CLKDIV =  %x\r\n", SPIModule->CLKDIV);
    //printf("3 u32ReturnValue =  %d\r\n", u32ReturnValue);
    CU_ASSERT(SPIModule->CTL == 0x0000183F);
    CU_ASSERT(SPIModule->CLKDIV == 0x00000009);
    CU_ASSERT(SPIModule->SSCTL == 0x0);
    CU_ASSERT(u32ReturnValue == 4800000);

