wosayttn/M55M1BSP/_CUnit/spi/spi_cunit.c
    SPIModule->CLKDIV = 0;
    /* Slave selection signal is low-active. */
    SPIModule->SSCTL = 0;
    /* Slave mode, SPI mode 0. */
    SPIModule->CTL = 0x00040005;

    for (u32DelayCount = 0; u32DelayCount < 10; u32DelayCount++)
    {
        __NOP();
    }

    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_SSACT_INT_MASK) == 0);
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_SSINACT_INT_MASK) == 0);
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_TXUF_INT_MASK) == 0);

    /* Set (SPIx_SS) to low level */
    SPIxCSSLow(GetSPIModuleIdx());

    for (u32DelayCount = 0; u32DelayCount < 5000; u32DelayCount++)
    {
        __NOP();
    }

    /* Check slave selection signal active interrupt flag */
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_SSACT_INT_MASK) == SPI_SSACT_INT_MASK);
    SPI_ClearIntFlag(SPIModule, SPI_SSACT_INT_MASK);
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_SSACT_INT_MASK) == 0);
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_SSINACT_INT_MASK) == 0);
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_SLVUR_INT_MASK) == 0);
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_SLVBE_INT_MASK) == 0);

    /* Check slave TX underflow interrupt flag */
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_TXUF_INT_MASK) == SPI_TXUF_INT_MASK);

    /* Set (SPIx_SS) to high level */
    SPIxCSSHigh(GetSPIModuleIdx());

    __NOP();
    /* Check slave selection signal inactive interrupt flag */
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_SSINACT_INT_MASK) == SPI_SSINACT_INT_MASK);
    SPI_ClearIntFlag(SPIModule, SPI_SSINACT_INT_MASK);
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_SSINACT_INT_MASK) == 0);

    /* Clear slave TX underflow interrupt flag */
    SPI_ClearIntFlag(SPIModule, SPI_TXUF_INT_MASK);
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_TXUF_INT_MASK) == 0);

    /* Check slave bit count error interrupt flag */
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_SLVBE_INT_MASK) == SPI_SLVBE_INT_MASK);
    SPI_ClearIntFlag(SPIModule, SPI_SLVBE_INT_MASK);
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_SLVBE_INT_MASK) == 0);

    /* Check slave TX under run interrupt flag */
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_SLVUR_INT_MASK) == SPI_SLVUR_INT_MASK);
    SPI_ClearIntFlag(SPIModule, SPI_SLVUR_INT_MASK);
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_SLVUR_INT_MASK) == 0);

    /* Disable self-test function */
    SPI_DisableSelfTest(GetSPIModuleIdx());

    if (GetSPIModuleIdx() == C_SPI0)
    {
        /* Set PA2 (SPI0_CLK) as SPI function pin */
        //SYS->GPA_MFPL = (SYS->GPA_MFPL & ~SYS_GPA_MFPL_PA2MFP_Msk) | SYS_GPA_MFPL_PA2MFP_SPI0_CLK;
        SPI0_CLK_PIN_INIT;
    }
    else if (GetSPIModuleIdx() == C_SPI1)
    {
        /* Set PA7 (SPI0_CLK) as SPI function pin */
        //SYS->GPA_MFPL = (SYS->GPA_MFPL & ~SYS_GPA_MFPL_PA7MFP_Msk) | SYS_GPA_MFPL_PA7MFP_SPI1_CLK;
        SPI1_CLK_PIN_INIT;
    }
    else if (GetSPIModuleIdx() == C_SPI2)
    {
        /* Set PA7 (SPI0_CLK) as SPI function pin */
        //SYS->GPA_MFPL = (SYS->GPA_MFPL & ~SYS_GPA_MFPL_PA7MFP_Msk) | SYS_GPA_MFPL_PA7MFP_SPI1_CLK;
        SPI2_CLK_PIN_INIT;
    }
    else if (GetSPIModuleIdx() == C_SPI3)
    {
        /* Set PA7 (SPI0_CLK) as SPI function pin */
        //SYS->GPA_MFPL = (SYS->GPA_MFPL & ~SYS_GPA_MFPL_PA7MFP_Msk) | SYS_GPA_MFPL_PA7MFP_SPI1_CLK;
        SPI3_CLK_PIN_INIT;
    }

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
    __NOP();


    /* TX threshold interrupt flag test */
    SPIModule->CLKDIV = 0xFF;
    /* Slave mode, SPI mode 0. */
    SPIModule->CTL = 0x00040005;
    /* Set TX and RX FIFO threshold */
    SPI_SetFIFO(SPIModule, 2, 2);
    /* Check TX threshold interrupt flag */
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_FIFO_TXTH_INT_MASK) == SPI_FIFO_TXTH_INT_MASK);
    /* Write to TX FIFO */
    SPIModule->TX = 1;
    SPIModule->TX = 2;
    SPIModule->TX = 3;
    SPIModule->TX = 4;
    /* Check TX threshold interrupt flag */
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_FIFO_TXTH_INT_MASK) == 0);
    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
    __NOP();

    /* RX threshold interrupt flag test */
    SPIModule->CLKDIV = 0xF;
    /* Set TX and RX FIFO threshold. */
    SPI_SetFIFO(SPIModule, 2, 2);
    /* Master mode, SPI mode 0. */
    SPIModule->CTL = 5;
    /* Check RX threshold interrupt flag */
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_FIFO_RXTH_INT_MASK) == 0);
    /* Write to TX FIFO */
    SPIModule->TX = 1;
    SPIModule->TX = 2;
    SPIModule->TX = 3;

    /* Wait data transfer */
    while (SPIModule->STATUS & SPI_STATUS_BUSY_Msk)
    {
        __NOP();
    }

    /* Check RX threshold interrupt flag */
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_FIFO_RXTH_INT_MASK) == SPI_FIFO_RXTH_INT_MASK);

    /* RX overrun interrupt flag test */
    /* Check RX overrun interrupt flag */
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_FIFO_RXOV_INT_MASK) == 0);
    /* Write to TX FIFO */
    SPIModule->TX = 4;
    SPIModule->TX = 5;
    SPIModule->TX = 6;
    SPIModule->TX = 7;
    SPIModule->TX = 8;
    SPIModule->TX = 9;

    /* Wait data transfer */
    while (SPIModule->STATUS & SPI_STATUS_BUSY_Msk)
    {
        __NOP();
    }

    /* Check RX overrun interrupt flag */
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_FIFO_RXOV_INT_MASK) == SPI_FIFO_RXOV_INT_MASK);
    SPI_ClearIntFlag(SPIModule, SPI_FIFO_RXOV_INT_MASK);
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_FIFO_RXOV_INT_MASK) == 0);

    /* RX time-out interrupt flag test */
    /* Clear RX time-out interrupt flag */
    SPI_ClearIntFlag(SPIModule, SPI_FIFO_RXTO_INT_MASK);
    /* Check RX time-out interrupt flag */
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_FIFO_RXTO_INT_MASK) == 0);
    /* Write to TX FIFO */
    SPIModule->TX = 1;
    SPIModule->TX = 2;
    SPIModule->TX = 3;

    /* Wait data transfer */
    while (SPIModule->STATUS & SPI_STATUS_BUSY_Msk)
    {
        __NOP();
    }

    /* Check RX time-out interrupt flag */
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_FIFO_RXTO_INT_MASK) == SPI_FIFO_RXTO_INT_MASK);
    SPI_ClearIntFlag(SPIModule, SPI_FIFO_RXTO_INT_MASK);
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_FIFO_RXTO_INT_MASK) == 0);

