wosayttn/M55M1BSP/_CUnit/spi/spi_cunit.c
    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
    __NOP();

    CLK_SysTickDelay(128);
}


void API_SPI_GetStatus()
{
    volatile uint32_t u32DelayCount = 0;
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPIModule->CLKDIV = 0;
    /* Check SPIEN flag */
    CU_ASSERT(SPI_GetStatus(SPIModule, SPI_SPIEN_STS_MASK) == 0);
    /* Slave mode, SPI mode 0. */
    SPIModule->CTL = 0x00040005;

    /* Check busy flag */
    CU_ASSERT(SPI_GetStatus(SPIModule, SPI_BUSY_MASK) == 0);

    /* Check SPIEN flag */
    CU_ASSERT(SPI_GetStatus(SPIModule, SPI_SPIEN_STS_MASK) == SPI_SPIEN_STS_MASK);

    /* SPI TX empty flag test */
    /* Check TX empty flag */
    CU_ASSERT(SPI_GetStatus(SPIModule, SPI_TX_EMPTY_MASK) == SPI_TX_EMPTY_MASK);
    /* Write to TX FIFO */
    SPIModule->TX = 1;
    SPIModule->TX = 2;
    /* Check TX empty flag */
    CU_ASSERT(SPI_GetStatus(SPIModule, SPI_TX_EMPTY_MASK) == 0);

    /* Check busy flag */
    CU_ASSERT(SPI_GetStatus(SPIModule, SPI_BUSY_MASK) == SPI_BUSY_MASK);

    /* SPI TX full flag test */
    /* Check TX full flag */
    CU_ASSERT(SPI_GetStatus(SPIModule, SPI_TX_FULL_MASK) == 0);
    /* Write to TX FIFO */
    SPIModule->TX = 3;
    SPIModule->TX = 4;
    SPIModule->TX = 5;
    SPIModule->TX = 6;
    SPIModule->TX = 7;
    SPIModule->TX = 8;
    SPIModule->TX = 9;
    /* Check TX full flag */
    CU_ASSERT(SPI_GetStatus(SPIModule, SPI_TX_FULL_MASK) == SPI_TX_FULL_MASK);
    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
    __NOP();

    /* SPI RX empty flag test */
    SPIModule->CLKDIV = 0xFF;
    /* Master mode, SPI mode 0. */
    SPIModule->CTL = 5;

    /* Check TX/RX reset flag */
    CU_ASSERT(SPI_GetStatus(SPIModule, SPI_TXRX_RESET_MASK) == 0);
    SPIModule->FIFOCTL |= SPI_FIFOCTL_RXRST_Msk;
    CU_ASSERT(SPI_GetStatus(SPIModule, SPI_TXRX_RESET_MASK) == SPI_TXRX_RESET_MASK);

    //for(u32DelayCount=0; u32DelayCount<256; u32DelayCount++) __NOP();
    for (u32DelayCount = 0; u32DelayCount < 10000; u32DelayCount++)
    {
        __NOP();
    }

    CU_ASSERT(SPI_GetStatus(SPIModule, SPI_TXRX_RESET_MASK) == 0);  //test!!

    /* Check RX empty flag */
    CU_ASSERT(SPI_GetStatus(SPIModule, SPI_RX_EMPTY_MASK) == SPI_RX_EMPTY_MASK);
    /* Write to TX FIFO */
    SPIModule->TX = 1;

    /* Wait data transfer */
    while (SPIModule->STATUS & SPI_STATUS_BUSY_Msk)
    {
        __NOP();
    }

    /* Check RX empty flag */
    CU_ASSERT(SPI_GetStatus(SPIModule, SPI_RX_EMPTY_MASK) == 0);

    /* SPI RX full flag test */
    /* Check RX full flag */
    CU_ASSERT(SPI_GetStatus(SPIModule, SPI_RX_FULL_MASK) == 0);
    /* Write to TX FIFO */
    SPIModule->TX = 2;
    SPIModule->TX = 3;
    SPIModule->TX = 4;
    SPIModule->TX = 5;
    SPIModule->TX = 6;
    SPIModule->TX = 7;
    SPIModule->TX = 8;

    /* Wait data transfer */
    while (SPIModule->STATUS & SPI_STATUS_BUSY_Msk)
    {
        __NOP();
    }

    /* Check RX full flag */
    CU_ASSERT(SPI_GetStatus(SPIModule, SPI_RX_FULL_MASK) == SPI_RX_FULL_MASK);
    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
    __NOP();


    SPIxModuleInitPIN(GetSPIModuleIdx());

    /* Set (SPIx_SS) to high level */
    SPIxCSSHigh(GetSPIModuleIdx());

    SPIModule->CLKDIV = 0;
    /* Slave selection signal is low-active. */
    SPIModule->SSCTL = 0;
    /* Slave mode, SPI mode 0. */
    SPIModule->CTL = 0x00040005;

    for (u32DelayCount = 0; u32DelayCount < 10; u32DelayCount++)
    {
        __NOP();
    }

    CU_ASSERT(SPI_GetStatus(SPIModule, SPI_SSLINE_STS_MASK) == SPI_SSLINE_STS_MASK);

    /* Set (SPIx_SS) to low level */
    SPIxCSSLow(GetSPIModuleIdx());

    for (u32DelayCount = 0; u32DelayCount < 1000; u32DelayCount++)
    {
        __NOP();
    }

    CU_ASSERT(SPI_GetStatus(SPIModule, SPI_SSLINE_STS_MASK) == 0);
    __NOP();

    /* Disable self-test function */
    SPI_DisableSelfTest(GetSPIModuleIdx());

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
    __NOP();
}

void API_SPI_GetStatus2()
{
    volatile uint32_t u32DelayCount;
    volatile uint32_t u32RxData, i32BitCount;
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPIxModuleInitPIN(GetSPIModuleIdx());

    u32RxData = 0x12345678;

    /* Set (SPIx_SS) to high level */
    SPIxCSSHigh(GetSPIModuleIdx());

    /* Set (SPIx_CLK) to high level */
    SPIxClkHigh(GetSPIModuleIdx());

    SPIModule->CLKDIV = 0;
    /* Slave selection signal is low-active. */
    SPIModule->SSCTL = 0;
    /* Slave mode, SPI mode 0. */
    SPIModule->CTL = 0x00040005;
    /* Enable RX FIFO write data enable when slave mode bit count error. */
    SPIModule->FIFOCTL = 0x00000400;

    for (u32DelayCount = 0; u32DelayCount < 10; u32DelayCount++)
    {
        __NOP();
    }

    /* Set SPI_SS pin to active state */
    SPIxCSSLow(GetSPIModuleIdx());

    for (i32BitCount = 0; i32BitCount <= 15; i32BitCount++)
    {
        SPIxClkLow(GetSPIModuleIdx()); /* TX clock edge */

        //PA0 = u32RxData >> i32BitCount; /* Set SPI_MOSI pin state */
        SPIxMISOWriteData(GetSPIModuleIdx(), (u32RxData >> i32BitCount)); /* Set SPI_MOSI pin state */

        SPIxClkHigh(GetSPIModuleIdx()); /* RX clock edge */

        __NOP();
        __NOP();
        __NOP();
    }

    /* Set SPI_SS pin to inactive state */
    SPIxCSSHigh(GetSPIModuleIdx());

    /* Check SLVBENUM number */
    CU_ASSERT(SPI_GetStatus2(SPIModule, SPI_SLVBENUM_MASK) == 16);

    /* Disable self-test function */
    SPI_DisableSelfTest(GetSPIModuleIdx());

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
    __NOP();
}

//void API_SPI_GetStatus2()
//{
//    SPI0->CLKDIV = 0;
//    /* Slave selection signal is low-active. */
//    SPI0->SSCTL = 0;
//    /* Slave mode, SPI mode 0. */
//    SPI0->CTL = 0x00040005;
//    /* Enable RX FIFO write data enable when slave mode bit count error. */
//    SPI0->FIFOCTL = 0x00000400;

//    /* Check SLVBENUM number */
//    CU_ASSERT(SPI_GetStatus2(SPI0, SPI_SLVBENUM_MASK) == 0);

//    /* Reset SPI0 */
//    SYS->IPRST1 |= SYS_IPRST1_SPI0RST_Msk;
//    SYS->IPRST1 &= ~SYS_IPRST1_SPI0RST_Msk;
//    __NOP();
//}

