wosayttn/M55M1BSP/_CUnit/spi/spi_cunit.c
/* -------------- I2S test -------------- */

void MACRO_I2S_ENABLE_DISABLE_TX_ZCD()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPII2S_ENABLE_TX_ZCD(SPIModule, SPII2S_RIGHT);
    /* Check RZCIEN bit */
    CU_ASSERT_TRUE(SPIModule->I2SCTL & 0x00010000);
    SPII2S_DISABLE_TX_ZCD(SPIModule, SPII2S_RIGHT);
    /* Check RZCIEN bit */
    CU_ASSERT_FALSE(SPIModule->I2SCTL & 0x00010000);
    SPII2S_ENABLE_TX_ZCD(SPIModule, SPII2S_LEFT);
    /* Check LZCIEN bit */
    CU_ASSERT_TRUE(SPIModule->I2SCTL & 0x00020000);
    SPII2S_DISABLE_TX_ZCD(SPIModule, SPII2S_LEFT);
    /* Check LZCIEN bit */
    CU_ASSERT_FALSE(SPIModule->I2SCTL & 0x00020000);

    /* Reset SPI */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_I2S_ENABLE_DISABLE_TXDMA()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPII2S_ENABLE_TXDMA(SPIModule);
    /* Check TXPDMAEN bit */
    CU_ASSERT_TRUE(SPIModule->PDMACTL & 0x00000001);
    SPII2S_DISABLE_TXDMA(SPIModule);
    /* Check TXPDMAEN bit */
    CU_ASSERT_FALSE(SPIModule->PDMACTL & 0x00000001);
    /* Reset SPI */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_I2S_ENABLE_DISABLE_RXDMA()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPII2S_ENABLE_RXDMA(SPIModule);
    /* Check RXPDMAEN bit */
    CU_ASSERT_TRUE(SPIModule->PDMACTL & 0x00000002);
    SPII2S_DISABLE_RXDMA(SPIModule);
    /* Check RXPDMAEN bit */
    CU_ASSERT_FALSE(SPIModule->PDMACTL & 0x00000002);

    /* Reset SPI */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_I2S_ENABLE_DISABLE_TX()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPII2S_ENABLE_TX(SPIModule);
    /* Check TX enable bit */
    CU_ASSERT_TRUE(SPIModule->I2SCTL & 2);
    SPII2S_DISABLE_TX(SPIModule);
    /* Check TX enable bit */
    CU_ASSERT_FALSE(SPIModule->I2SCTL & 2);

    /* Reset SPI */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_I2S_ENABLE_DISABLE_RX()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPII2S_ENABLE_RX(SPIModule);
    /* Check RX enable bit */
    CU_ASSERT_TRUE(SPIModule->I2SCTL & 4);
    SPII2S_DISABLE_RX(SPIModule);
    /* Check RX enable bit */
    CU_ASSERT_FALSE(SPIModule->I2SCTL & 4);

    /* Reset SPI */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_I2S_ENABLE_DISABLE_TX_MUTE()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPII2S_ENABLE_TX_MUTE(SPIModule);
    /* Check TX mute enable bit */
    CU_ASSERT_TRUE(SPIModule->I2SCTL & 8);
    SPII2S_DISABLE_TX_MUTE(SPIModule);
    /* Check TX mute enable bit */
    CU_ASSERT_FALSE(SPIModule->I2SCTL & 8);

    /* Reset SPI */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_I2S_CLR_TX_FIFO()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    /* Write 3 data to TX FIFO */
    SPII2S_WRITE_TX_FIFO(SPIModule, 1);
    SPII2S_WRITE_TX_FIFO(SPIModule, 2);
    SPII2S_WRITE_TX_FIFO(SPIModule, 3);

    SPII2S_CLR_TX_FIFO(SPIModule);

    CU_ASSERT(SPII2S_GET_TX_FIFO_LEVEL(SPIModule) == 0);
    /* CLR_TXFIFO bit should be cleared by hardware automatically */
    CU_ASSERT_FALSE(SPIModule->FIFOCTL & 0x00000200);

    /* Reset SPI */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_I2S_CLR_RX_FIFO()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    /* Enable I2S RX function */
    SPIModule->I2SCTL = 5;

    while (SPIModule->STATUS & SPI_I2SSTS_RXEMPTY_Msk);

    /* Disable I2S RX function */
    SPIModule->I2SCTL = 0;

    SPII2S_CLR_RX_FIFO(SPIModule);

    CU_ASSERT(SPII2S_GET_RX_FIFO_LEVEL(SPIModule) == 0);
    /* CLR_RXFIFO bit should be cleared by hardware automatically */
    CU_ASSERT_FALSE(SPIModule->FIFOCTL & 0x00000100);
}

void MACRO_I2S_SET_MONO_RX_CHANNEL()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPII2S_SET_MONO_RX_CHANNEL(SPIModule, SPII2S_MONO_LEFT);
    /* Check RXLCH bit */
    CU_ASSERT_TRUE(SPIModule->I2SCTL & 0x00800000);
    SPII2S_SET_MONO_RX_CHANNEL(SPIModule, SPII2S_MONO_RIGHT);
    /* Check RXLCH bit */
    CU_ASSERT_FALSE(SPIModule->I2SCTL & 0x00800000);

    /* Reset SPI */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_I2S_WRITE_TX_FIFO()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    /* Set I2S bit clock divider */
    SPIModule->I2SCLK = 0x1FF00;
    /* Slave mode; I2S enabled. */
    SPIModule->I2SCTL = 0x00000101;

    /* Write 2 data to TX FIFO */
    SPII2S_WRITE_TX_FIFO(SPIModule, 1);
    SPII2S_WRITE_TX_FIFO(SPIModule, 2);

    CU_ASSERT(SPII2S_GET_TX_FIFO_LEVEL(SPIModule) == 2);

    SPII2S_WRITE_TX_FIFO(SPIModule, 3);

    CU_ASSERT(SPII2S_GET_TX_FIFO_LEVEL(SPIModule) == 3);

    SPII2S_CLR_TX_FIFO(SPIModule);
    CU_ASSERT(SPII2S_GET_TX_FIFO_LEVEL(SPIModule) == 0);

    /* Reset SPI1 */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_I2S_READ_RX_FIFO()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    /* Set I2S bit clock divider */
    SPIModule->I2SCLK = 0x8000;
    /* Enable I2S RX function */
    SPIModule->I2SCTL = 5;

    while ((SPIModule->I2SSTS & 0x0F000000) != 0x03000000);

    /* Disable I2S RX function */
    SPIModule->I2SCTL = 1;

    SPII2S_READ_RX_FIFO(SPIModule);

    CU_ASSERT(SPII2S_GET_RX_FIFO_LEVEL(SPIModule) == 2);

    SPII2S_READ_RX_FIFO(SPIModule);

    CU_ASSERT(SPII2S_GET_RX_FIFO_LEVEL(SPIModule) == 1);

    SPII2S_READ_RX_FIFO(SPIModule);

    CU_ASSERT(SPII2S_GET_RX_FIFO_LEVEL(SPIModule) == 0);

    /* Reset SPI1 */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_I2S_GET_CLEAR_INT_FLAG()
{
    uint32_t u32DelayCount;
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    /* Left channel zero-cross flag test */
    /* Set I2S bit clock divider */
    SPIModule->I2SCLK = 0x8000;
    /* Enable left channel zero-cross detection function, I2S RX function, I2S TX function and I2S controller. */
    SPIModule->I2SCTL = 0x00020007;

