wosayttn/M55M1BSP/_CUnit/spi/spi_cunit.c
    while (SPII2S_GET_RX_FIFO_LEVEL(SPIModule) <= 2);

    SPIModule->I2SCTL = 1;

    CU_ASSERT(SPII2S_GET_INT_FLAG(SPIModule, SPI_I2SSTS_LZCIF_Msk) == 0x00200000);

    SPII2S_CLR_INT_FLAG(SPIModule, SPI_I2SSTS_LZCIF_Msk);

    CU_ASSERT(SPII2S_GET_INT_FLAG(SPIModule, SPI_I2SSTS_LZCIF_Msk) == 0);
    /* Reset SPI1 */
    ResetSPI(GetSPIModuleIdx());
    __NOP();

    /* Right channel zero-cross flag test */
    /* Set I2S bit clock divider */
    SPIModule->I2SCLK = 0x8000;
    /* Enable right channel zero-cross detection function, I2S RX function, I2S TX function and I2S controller. */
    SPIModule->I2SCTL = 0x00010007;

    while (SPII2S_GET_RX_FIFO_LEVEL(SPIModule) <= 2);

    SPIModule->I2SCTL = 1;

    CU_ASSERT(SPII2S_GET_INT_FLAG(SPIModule, SPI_I2SSTS_RZCIF_Msk) == 0x00100000);

    SPII2S_CLR_INT_FLAG(SPIModule, SPI_I2SSTS_RZCIF_Msk);

    CU_ASSERT(SPII2S_GET_INT_FLAG(SPIModule, SPI_I2SSTS_RZCIF_Msk) == 0);
    /* Reset SPI1 */
    ResetSPI(GetSPIModuleIdx());
    __NOP();

    /* TX threshold interrupt flag test */
    /* Set I2S bit clock divider */
    SPIModule->I2SCLK = 0x8000;
    /* Enable I2S controller and TX function; set TX threshold as 2. */
    SPIModule->FIFOCTL = 0x20000000;
    SPIModule->I2SCTL = 0x3;

    CU_ASSERT(SPII2S_GET_INT_FLAG(SPIModule, SPI_I2SSTS_TXTHIF_Msk) == 0x00040000);

    /* Write 4 data to TX FIFO */
    SPII2S_WRITE_TX_FIFO(SPIModule, 1);
    SPII2S_WRITE_TX_FIFO(SPIModule, 2);
    SPII2S_WRITE_TX_FIFO(SPIModule, 3);
    SPII2S_WRITE_TX_FIFO(SPIModule, 4);

    CU_ASSERT(SPII2S_GET_INT_FLAG(SPIModule, SPI_I2SSTS_TXTHIF_Msk) == 0);
    /* Reset SPI1 */
    ResetSPI(GetSPIModuleIdx());
    __NOP();

    /* TX underflow interrupt flag test */
    /* Set I2S bit clock divider */
    SPIModule->I2SCLK = 0x8000;
    /* Enable I2S RX function, I2S TX function and I2S controller. */
    SPIModule->I2SCTL = 0x00000007;

    while (SPII2S_GET_RX_FIFO_LEVEL(SPIModule) <= 2);

    SPIModule->I2SCTL = 1;

    CU_ASSERT(SPII2S_GET_INT_FLAG(SPIModule, SPI_I2SSTS_TXUFIF_Msk) == 0x00080000);

    SPII2S_CLR_INT_FLAG(SPIModule, SPI_I2SSTS_TXUFIF_Msk);

    CU_ASSERT(SPII2S_GET_INT_FLAG(SPIModule, SPI_I2SSTS_TXUFIF_Msk) == 0);
    /* Reset SPI1 */
    ResetSPI(GetSPIModuleIdx());
    __NOP();

    /* RX threshold interrupt flag test */
    /* Set I2S bit clock divider */
    SPIModule->I2SCLK = 0xFF00;
    /* Set RX threshold as 2; enable I2S RX function and I2S controller. */
    SPIModule->FIFOCTL = 0x02000000;
    SPIModule->I2SCTL = 0x00000005;

    while (SPII2S_GET_RX_FIFO_LEVEL(SPIModule) <= 2)
    {
        __NOP();
    }

    //SPI1->I2SCTL = 0;

    CU_ASSERT(SPII2S_GET_INT_FLAG(SPIModule, SPI_I2SSTS_RXTHIF_Msk) == 0x00000400);

    SPII2S_READ_RX_FIFO(SPIModule);
    SPII2S_READ_RX_FIFO(SPIModule);

    CU_ASSERT(SPII2S_GET_INT_FLAG(SPIModule, SPI_I2SSTS_RXTHIF_Msk) == 0);
    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
    __NOP();

    /* RX overflow interrupt flag test */
    /* Set I2S bit clock divider */
    SPIModule->I2SCLK = 0x8000;
    /* Enable I2S RX function, I2S TX function and I2S controller. */
    SPIModule->I2SCTL = 0x00000007;

    while (SPII2S_GET_RX_FIFO_LEVEL(SPIModule) != 4);

    /* Write 4 data to TX FIFO */
    SPII2S_WRITE_TX_FIFO(SPIModule, 1);
    SPII2S_WRITE_TX_FIFO(SPIModule, 2);
    SPII2S_WRITE_TX_FIFO(SPIModule, 3);
    SPII2S_WRITE_TX_FIFO(SPIModule, 4);

    while (SPII2S_GET_TX_FIFO_LEVEL(SPIModule) != 0);

    SPIModule->I2SCTL = 1;

    CU_ASSERT(SPII2S_GET_INT_FLAG(SPIModule, SPI_I2SSTS_RXOVIF_Msk) == 0x00000800);

    SPII2S_CLR_INT_FLAG(SPIModule, SPI_I2SSTS_RXOVIF_Msk);

    CU_ASSERT(SPII2S_GET_INT_FLAG(SPIModule, SPI_I2SSTS_RXOVIF_Msk) == 0);

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
    __NOP();

    /* RX time-out interrupt flag test */
    /* Set I2S bit clock divider */
    SPIModule->I2SCLK = 0x100;
    /* Enable I2S RX function, TX function and I2S controller */
    SPIModule->I2SCTL = 7;

    SPII2S_WRITE_TX_FIFO(SPIModule, 1);
    SPII2S_WRITE_TX_FIFO(SPIModule, 2);
    SPII2S_WRITE_TX_FIFO(SPIModule, 3);
    SPII2S_WRITE_TX_FIFO(SPIModule, 4);

    while (SPII2S_GET_TX_FIFO_LEVEL(SPIModule) != 0)
    {
        __NOP();
    }

    for (u32DelayCount = 0; u32DelayCount < 1000; u32DelayCount++)
    {
        __NOP();
    }

    CU_ASSERT(SPII2S_GET_INT_FLAG(SPIModule, SPI_I2SSTS_RXTOIF_Msk) == 0x00001000);

    SPII2S_CLR_INT_FLAG(SPIModule, SPI_I2SSTS_RXTOIF_Msk);

    CU_ASSERT(SPII2S_GET_INT_FLAG(SPIModule, SPI_I2SSTS_RXTOIF_Msk) == 0);

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
    __NOP();
}

void MACRO_I2S_GET_TX_FIFO_LEVEL()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    /* Set I2S bit clock divider */
    SPIModule->I2SCLK = 0x1FF00;
    /* Enable I2S controller */
    SPIModule->I2SCTL = 1;

    /* Write data to TX FIFO */
    SPII2S_WRITE_TX_FIFO(SPIModule, 1);

    CU_ASSERT(SPII2S_GET_TX_FIFO_LEVEL(SPIModule) == 1);

    SPII2S_WRITE_TX_FIFO(SPIModule, 2);

    CU_ASSERT(SPII2S_GET_TX_FIFO_LEVEL(SPIModule) == 2);

    SPII2S_WRITE_TX_FIFO(SPIModule, 3);

    CU_ASSERT(SPII2S_GET_TX_FIFO_LEVEL(SPIModule) == 3);

    SPII2S_WRITE_TX_FIFO(SPIModule, 4);

    CU_ASSERT(SPII2S_GET_TX_FIFO_LEVEL(SPIModule) == 4);

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_I2S_GET_RX_FIFO_LEVEL()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    /* Set I2S bit clock divider */
    SPIModule->I2SCLK = 0x1FF00;
    /* Enable I2S RX function and I2S controller */
    SPIModule->I2SCTL = 5;

    while ((SPIModule->I2SSTS & 0x0F000000) != 0x01000000)
    {
        __NOP();
    }

    CU_ASSERT(SPII2S_GET_RX_FIFO_LEVEL(SPIModule) == 1);

    while ((SPIModule->I2SSTS & 0x0F000000) != 0x02000000)
    {
        __NOP();
    }

    CU_ASSERT(SPII2S_GET_RX_FIFO_LEVEL(SPIModule) == 2);

    while ((SPIModule->I2SSTS & 0x0F000000) != 0x03000000)
    {
        __NOP();
    }

