wosayttn/M55M1BSP/_CUnit/spi/spi_cunit.c
    {"Enable/Disable I2S TX zero-cross function", MACRO_I2S_ENABLE_DISABLE_TX_ZCD},
    {"Enable/Disable I2S TX PDMA function", MACRO_I2S_ENABLE_DISABLE_TXDMA},
    {"Enable/Disable I2S RX PDMA function", MACRO_I2S_ENABLE_DISABLE_RXDMA},
    {"Enable/Disable I2S TX function", MACRO_I2S_ENABLE_DISABLE_TX},
    {"Enable/Disable I2S RX function", MACRO_I2S_ENABLE_DISABLE_RX},
    {"Enable/Disable I2S TX mute function", MACRO_I2S_ENABLE_DISABLE_TX_MUTE},
    {"Clear I2S TX FIFO", MACRO_I2S_CLR_TX_FIFO},
    {"Clear I2S RX FIFO", MACRO_I2S_CLR_RX_FIFO},
    {"Select RX channel in I2S MONO mode", MACRO_I2S_SET_MONO_RX_CHANNEL},
    {"Write I2S TX FIFO", MACRO_I2S_WRITE_TX_FIFO},
    {"Read I2S RX FIFO", MACRO_I2S_READ_RX_FIFO},
    {"Get/Clear I2S interrupt flag", MACRO_I2S_GET_CLEAR_INT_FLAG},
    {"Get I2S TX FIFO level", MACRO_I2S_GET_TX_FIFO_LEVEL},
    {"Get I2S RX FIFO level", MACRO_I2S_GET_RX_FIFO_LEVEL},

    CU_TEST_INFO_NULL
};


CU_TestInfo SPI_I2S_ApiTests[] =
{
    {"SPI Open", API_SPI_Open},
    {"SPI Close", API_SPI_Close},
    {"Clear SPI RX FIFO", API_SPI_ClearRxFIFO},
    {"Clear SPI TX FIFO", API_SPI_ClearTxFIFO},
    {"Enable/Disable SPI automatic slave selection function", API_SPI_EnableAutoSS_DisableAutoSS},
    {"Set/Get SPI bus clock rate", API_SPI_SetBusClock_GetBusClock},
    {"Set SPI FIFO threshold", API_SPI_SetFIFO},
    {"Enable/Disable SPI interrupt function", API_SPI_EnableInt_DisableInt},
    {"Get/Clear SPI interrupt flag", API_SPI_GetIntFlag_ClearIntFlag},
    {"Get SPI status", API_SPI_GetStatus},
    //{"Get SPI status2", API_SPI_GetStatus2}, //no test

    {"I2S Open", API_I2S_Open},
    {"I2S Close", API_I2S_Close},
    {"Enable/Disable I2S interrupt function", API_I2S_EnableInt_DisableInt},
    {"Enable MCLK", API_I2S_EnableMCLK},
    {"Disable MCLK", API_I2S_DisableMCLK},
    {"Set I2S FIFO threshold", API_I2S_SetFIFO},

    CU_TEST_INFO_NULL
};

CU_SuiteInfo suites[] =
{
    {"SPI/I2S MACRO", SPI_I2S_Tests_Init, SPI_I2S_Tests_Clean, NULL, NULL, SPI_I2S_MacroTests},
    {"SPI/I2S API", SPI_I2S_Tests_Init, SPI_I2S_Tests_Clean, NULL, NULL, SPI_I2S_ApiTests},
    CU_SUITE_INFO_NULL
};

/*** (C) COPYRIGHT 2016 Nuvoton Technology Corp. ***/
